# St7GetBeamLighting

Returns the state of the Lighting options for beam rendering.

long St7GetBeamLighting(long uID, bool* FillLighting, bool* LineLighting)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
FillLighting

The lighting option for beam fill; either True or False.

LineLighting

The lighting option for beam outlines; either True or False.